src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/РаботаСЗадачамиПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИОНАЛ ПОДСИСТЕМЫ "Учет задач пользователей" (ПОВТОРНО ИСПОЛЬЗУЕМЫЕ КЭШ ФУНКЦИИ)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ТаблицаИзбранныхПроектовТекущегоПользователя() Экспорт

	Возврат РаботаСЗадачами.ТаблицаИзбранныхПроектовТекущегоПользователя();
	
КонецФункции // СписокИзбранныхПроектовТекущегоПользователя()

// Функция возвращает состояния задач (Кэшированные на время сеанса)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* Ссылка
//		* УчитыватьПриРасчетеВремениВыполнения
//		* ОбязателенСрокСостояния
//		* ОбязательнаПричинаИзмененияСостояния
//
Функция СостоянияЗадачКэш() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СостоянияЗадач.Ссылка КАК Ссылка,
	               |	СостоянияЗадач.УчитыватьПриРасчетеВремениВыполнения КАК УчитыватьПриРасчетеВремениВыполнения,
	               |	СостоянияЗадач.ОбязателенСрокСостояния КАК ОбязателенСрокСостояния,
	               |	СостоянияЗадач.ОбязательнаПричинаИзмененияСостояния КАК ОбязательнаПричинаИзмененияСостояния,
	               |	СостоянияЗадач.ПроцентВыполнения100 КАК ПроцентВыполнения100
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	НЕ СостоянияЗадач.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции // СостоянияЗадачКэш()

// см. описание Справочники.НастройкиДоступностиПоСостояниюЗадачи.НастройкиДоступностиФормыЗадачи(...)
Функция НастройкиДоступностиФормыЗадачи(Контекст, ТипКонтекста = "ФормаЗадачи", ТипыПользователя = Неопределено) Экспорт
	
	Возврат Справочники.НастройкиДоступностиПоСостояниюЗадачи.НастройкиДоступностиФормыЗадачи(Контекст, ТипКонтекста, ТипыПользователя);
	
КонецФункции

// см. РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач() 
Функция ЭтоПолноправныйПользовательЗадач() Экспорт

	Возврат РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач();	

КонецФункции 

// см. Пользователи.ТекущийПользователь()
Функция ТекущийПользователь() Экспорт

	Возврат Пользователи.ТекущийПользователь();

КонецФункции 

#КонецОбласти
